name: "text_encoder"
platform: "onnxruntime_onnx"
default_model_filename: "model.onnx"
max_batch_size : 0
input [
  {
    name: "input_ids"
    data_type: TYPE_INT32
    dims: [ -1, -1]
  }
]
output [
  {
    name: "last_hidden_state"
    data_type: TYPE_FP32
    dims: [ -1, -1, 768 ]
  },
  {
    name: "pooler_output"
    data_type: TYPE_FP32
    dims: [ -1, 768 ]
  }
]
instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [ 0 ]
  }
]