name: "vae_decoder"
platform: "onnxruntime_onnx"
default_model_filename: "model.onnx"
max_batch_size : 0
input [
  {
    name: "latent_sample"
    data_type: TYPE_FP32
    dims: [ -1, -1, -1, -1 ]
  }
]
output [
  {
    name: "sample"
    data_type: TYPE_FP32
    dims: [ -1, 3, -1, -1 ]
  }
]
instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [ 0 ]
  }
]